RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/CMSIS/Device/ST/STM32H7RSxx/Include/stm32h7s7xx.h
/*!< Unique device ID register base address */
#define UID_BASE                        (0x08FFF800UL)

/*!< Flash size data register base address  */
#define FLASHSIZE_BASE                  (0x08FFF80CUL)

/*!< Package data register base address     */
#define PACKAGE_BASE                    (0x08FFF80CUL)

/* USB OTG registers base addresses */
#define USB_OTG_GLOBAL_BASE                  (0x0000UL)
#define USB_OTG_DEVICE_BASE                  (0x0800UL)
#define USB_OTG_IN_ENDPOINT_BASE             (0x0900UL)
#define USB_OTG_OUT_ENDPOINT_BASE            (0x0B00UL)
#define USB_OTG_EP_REG_SIZE                  (0x0020UL)
#define USB_OTG_HOST_BASE                    (0x0400UL)
#define USB_OTG_HOST_PORT_BASE               (0x0440UL)
#define USB_OTG_HOST_CHANNEL_BASE            (0x0500UL)
#define USB_OTG_HOST_CHANNEL_SIZE            (0x0020UL)
#define USB_OTG_PCGCCTL_BASE                 (0x0E00UL)
#define USB_OTG_FIFO_BASE                    (0x1000UL)
#define USB_OTG_FIFO_SIZE                    (0x1000UL)

/*!< Root Secure Service Library */
/************ RSSLIB system Flash region definition constants *************/
#define RSSLIB_SYS_FLASH_PFUNC_START   (0x1FF1FD4CUL)
#define RSSLIB_SYS_FLASH_PFUNC_END     (0x1FF1FD78UL)

/************ RSSLIB function return constants ********************************/
#define RSSLIB_ERROR   (0xF5F5F5F5UL)
#define RSSLIB_SUCCESS (0xEAEAEAEAUL)

/*!< RSSLIB  pointer function structure address definition */
#define RSSLIB_PFUNC_BASE (0x1FF1FD4CUL)
#define RSSLIB_PFUNC      ((RSSLIB_pFunc_TypeDef *)RSSLIB_PFUNC_BASE)

/**
  * @brief  Prototype of RSSLIB Jump to HDP level2 Function
  * @detail This function increments HDP level up to HDP level 2
  *         Then it enables the MPU region corresponding the MPU index
  *         provided as input parameter. The Vector Table shall be located
  *         within this MPU region.
  *         Then it jumps to the reset handler present within the
  *         Vector table. The function does not return on successful execution.
  * @param  pointer on the vector table containing the reset handler the function
  *         jumps to.
  * @param  MPU region index containing the vector table
  *         jumps to.
  * @retval RSSLIB_RSS_ERROR on error on input parameter, otherwise does not return.
  */
typedef uint32_t (*RSSLIB_JumpHDPlvl2_TypeDef)(uint32_t VectorTableAddr, uint32_t MPUIndex);

/**
  * @brief  Prototype of RSSLIB Jump to HDP level3 Function
  * @detail This function increments HDP level up to HDP level 3
  *         Then it enables the MPU region corresponding the MPU index
  *         provided as input parameter. The Vector Table shall be located
  *         within this MPU region.
  *         Then it jumps to the reset handler present within the
  *         Vector table. The function does not return on successful execution.
  * @param  pointer on the vector table containing the reset handler the function
  *         jumps to.
  * @param  MPU region index containing the vector table
  *         jumps to.
  * @retval RSSLIB_RSS_ERROR on error on input parameter, otherwise does not return.
  */
typedef uint32_t (*RSSLIB_JumpHDPlvl3_TypeDef)(uint32_t VectorTableAddr, uint32_t MPUIndex);

/**
  * @brief Input parameter definition of RSSLIB_DataProvisioning
  */
typedef struct
{
  uint32_t *pSource;        /*!< Address of the Data to be provisioned, shall be in SRAM3 */
  uint32_t Destination;     /*!< OBKeys destination information where to provision Data */
  uint32_t Size;            /*!< Size in bytes of the Data to be provisioned*/
  uint32_t DoEncryption;    /*!< Notifies RSSLIB_DataProvisioning to encrypt or not Data*/
  uint32_t Crc;             /*!< CRC over full Data buffer and previous field in the structure*/
} RSSLIB_DataProvisioningConf_t;

/**
  * @brief  Prototype of RSSLIB Data Provisioning Function
  * @detail This function write Data within OBKeys sections.
  * @param  pointer on the structure defining Data to be provisioned and where to
  * provision them within OBKeys sections.
  * @retval RSSLIB_RSS_ERROR on error on input parameter, otherwise does not return.
  */
typedef uint32_t (*RSSLIB_DataProvisioning_TypeDef)(RSSLIB_DataProvisioningConf_t *pConfig);

/**
  * @brief  Prototype of RSSLIB Set Secure OB Function
  * @detail This function configure a secure OB.
  * @param  OB address among following values:
  * &(FLASH->WRPSRP), &(FLASH->HDPSRP) or &(FLASH->ROTSRP)
  * @param  OB mask (example 0x000000FF for updating WRP OB).
  * @param  OB value
  * @param  OB Pos: bit position of OB value.
  * 			ObValue << ObPos must be aligned on ObMask.
  * @retval RSSLIB_RSS_ERROR on error, otherwise does not return.
  */
typedef uint32_t (*RSSLIB_SetSecOB_TypeDef)(uint32_t ObAddr, uint32_t ObMask, uint32_t ObValue, uint32_t ObPos);

/**
  * @brief  Prototype of RSSLIB Get RSS Status Function
  * @detail This function return RSS Status.
  * Calling GetRssStatus is only relevant after calling
  * SetSecOB or DataProvisioning.
  * @param  none.
  * @retval RSSLIB_SUCCESS on success, otherwise return an error 0xF5F5xxxx.
  */
typedef uint32_t (*RSSLIB_GetRssStatus_TypeDef)(void);

/**
  * @brief  Prototype of RSSLIB Set Product State Function
  * @detail This function change Product State.
  * @param  Requested Product State among following values:
  * 0x17 : Provisioning
  * 0x72 : Closed
  * 0x5C : Locked
  * @retval RSSLIB_RSS_ERROR on error, otherwise does not return.
  */
typedef uint32_t (*RSSLIB_SetProductState_TypeDef)(uint32_t ProductState);

/**
  * @brief  Prototype of RSSLIB Get Product State Function
  * @detail This function return current Product State.
  * @param  none.
  * @retval RSSLIB_RSS_ERROR on error,
  * otherwise return product state among following values:
  * 0x39 : Open
  * 0x17 : Provisioning
  * 0x72 : Closed
  * 0x5C : Locked
  */
typedef uint32_t (*RSSLIB_GetProductState_TypeDef)(void);


/**
  * @brief RSSLib callable function pointer structure
  */
typedef struct
{
  __IM RSSLIB_SetSecOB_TypeDef SetSecOB;
  uint32_t RESERVED1[4];
  __IM RSSLIB_GetRssStatus_TypeDef GetRssStatus;
  __IM RSSLIB_SetProductState_TypeDef SetProductState;
  __IM RSSLIB_DataProvisioning_TypeDef DataProvisioning;
  __IM RSSLIB_JumpHDPlvl2_TypeDef JumpHDPLvl2;
  __IM RSSLIB_JumpHDPlvl3_TypeDef JumpHDPLvl3;
  __IM RSSLIB_GetProductState_TypeDef GetProductState;
} RSSLIB_pFunc_TypeDef;


/** @} */ /* End of group STM32H7RSxx_Peripheral_peripheralAddr */


/* =========================================================================================================================== */
/* ================                                  Peripheral declaration                                   ================ */
/* =========================================================================================================================== */


/** @addtogroup STM32H7RSxx_Peripheral_declaration
  * @{
  */

#define ADC1                   ((ADC_TypeDef *) ADC1_BASE)
#define ADC2                   ((ADC_TypeDef *) ADC2_BASE)
#define ADC12_COMMON           ((ADC_Common_TypeDef *) ADC12_COMMON_BASE)
#define ADF1                   ((MDF_TypeDef *) ADF1_BASE)
#define ADF1_Filter0           ((MDF_Filter_TypeDef *) ADF1_Filter0_BASE)
#define AXIM_AMIB_1            ((AXIM_AMIB_TypeDef *) AXIM_AMIB1_BASE )
#define AXIM_AMIB_2            ((AXIM_AMIB_TypeDef *) AXIM_AMIB2_BASE )
#define AXIM_AMIB_3            ((AXIM_AMIB_TypeDef *) AXIM_AMIB3_BASE )
#define AXIM_AMIB_4            ((AXIM_AMIB_TypeDef *) AXIM_AMIB4_BASE )
#define AXIM_AMIB_5            ((AXIM_AMIB_TypeDef *) AXIM_AMIB5_BASE )
#define AXIM_AMIB_6            ((AXIM_AMIB_TypeDef *) AXIM_AMIB6_BASE )
#define AXIM_AMIB_7            ((AXIM_AMIB_TypeDef *) AXIM_AMIB7_BASE )
#define AXIM_AMIB_8            ((AXIM_AMIB_TypeDef *) AXIM_AMIB8_BASE )
#define AXIM_AMIB_9            ((AXIM_AMIB_TypeDef *) AXIM_AMIB9_BASE )
#define AXIM_AMIB_10           ((AXIM_AMIB_TypeDef *) AXIM_AMIB10_BASE)
#define AXIM_ASIB_1            ((AXIM_ASIB_TypeDef *) AXIM_ASIB1_BASE )
#define AXIM_ASIB_2            ((AXIM_ASIB_TypeDef *) AXIM_ASIB2_BASE )
#define AXIM_ASIB_3            ((AXIM_ASIB_TypeDef *) AXIM_ASIB3_BASE )
#define AXIM_ASIB_4            ((AXIM_ASIB_TypeDef *) AXIM_ASIB4_BASE )
#define AXIM_ASIB_5            ((AXIM_ASIB_TypeDef *) AXIM_ASIB5_BASE )
#define AXIM_ASIB_6            ((AXIM_ASIB_TypeDef *) AXIM_ASIB6_BASE )
#define AXIM_ASIB_7            ((AXIM_ASIB_TypeDef *) AXIM_ASIB7_BASE )
#define AXIM_ASIB_8            ((AXIM_ASIB_TypeDef *) AXIM_ASIB8_BASE )
#define AXIM_ASIB_9            ((AXIM_ASIB_TypeDef *) AXIM_ASIB9_BASE )
#define AXIM_ASIB_10           ((AXIM_ASIB_TypeDef *) AXIM_ASIB10_BASE)
#define AXIM_ASIB_11           ((AXIM_ASIB_TypeDef *) AXIM_ASIB11_BASE)
#define CEC                    ((CEC_TypeDef *) CEC_BASE)
#define CORDIC                 ((CORDIC_TypeDef *) CORDIC_BASE)
#define CRC                    ((CRC_TypeDef *) CRC_BASE)
#define CRS                    ((CRS_TypeDef *) CRS_BASE)
#define CRYP                   ((CRYP_TypeDef *) CRYP_BASE)
#define DBGMCU                 ((DBGMCU_TypeDef *) DBGMCU_BASE)
#define DCMIPP                 ((DCMIPP_TypeDef *) DCMIPP_BASE)
#define DLYB_SDMMC1            ((DLYB_TypeDef *) DLYB_SDMMC1_BASE)
#define DLYB_SDMMC2            ((DLYB_TypeDef *) DLYB_SDMMC2_BASE)
#define DMA2D                  ((DMA2D_TypeDef *) DMA2D_BASE)
#define DTS                    ((DTS_TypeDef *) DTS_BASE)
#define ETH                    ((ETH_TypeDef *)ETH_BASE)
#define EXTI                   ((EXTI_TypeDef *) EXTI_BASE)
#define FDCAN1                 ((FDCAN_GlobalTypeDef *) FDCAN1_BASE)
#define FDCAN2                 ((FDCAN_GlobalTypeDef *) FDCAN2_BASE)
#define FDCAN_CONFIG           ((FDCAN_Config_TypeDef *) FDCAN_CONFIG_BASE)
#define FLASH                  ((FLASH_TypeDef *) FLASH_R_BASE)
#define FMC_Bank1_R            ((FMC_Bank1_TypeDef *) FMC_Bank1_R_BASE)
#define FMC_Bank1E_R           ((FMC_Bank1E_TypeDef *) FMC_Bank1E_R_BASE)
#define FMC_Bank3_R            ((FMC_Bank3_TypeDef *) FMC_Bank3_R_BASE)
#define FMC_Bank5_6_R          ((FMC_Bank5_6_TypeDef *) FMC_Bank5_6_R_BASE)
#define GFXTIM                 ((GFXTIM_TypeDef *) GFXTIM_BASE)
#define GFXMMU                 ((GFXMMU_TypeDef *) GFXMMU_BASE)
#define GPU2D                  GPU2D_BASE
#define GPDMA1                 ((DMA_TypeDef *) GPDMA1_BASE)
#define GPDMA1_Channel0        ((DMA_Channel_TypeDef *) GPDMA1_Channel0_BASE)
#define GPDMA1_Channel1        ((DMA_Channel_TypeDef *) GPDMA1_Channel1_BASE)
#define GPDMA1_Channel2        ((DMA_Channel_TypeDef *) GPDMA1_Channel2_BASE)
#define GPDMA1_Channel3        ((DMA_Channel_TypeDef *) GPDMA1_Channel3_BASE)
#define GPDMA1_Channel4        ((DMA_Channel_TypeDef *) GPDMA1_Channel4_BASE)
#define GPDMA1_Channel5        ((DMA_Channel_TypeDef *) GPDMA1_Channel5_BASE)
#define GPDMA1_Channel6        ((DMA_Channel_TypeDef *) GPDMA1_Channel6_BASE)
#define GPDMA1_Channel7        ((DMA_Channel_TypeDef *) GPDMA1_Channel7_BASE)
#define GPDMA1_Channel8        ((DMA_Channel_TypeDef *) GPDMA1_Channel8_BASE)
#define GPDMA1_Channel9        ((DMA_Channel_TypeDef *) GPDMA1_Channel9_BASE)
#define GPDMA1_Channel10       ((DMA_Channel_TypeDef *) GPDMA1_Channel10_BASE)
#define GPDMA1_Channel11       ((DMA_Channel_TypeDef *) GPDMA1_Channel11_BASE)
#define GPDMA1_Channel12       ((DMA_Channel_TypeDef *) GPDMA1_Channel12_BASE)
#define GPDMA1_Channel13       ((DMA_Channel_TypeDef *) GPDMA1_Channel13_BASE)
#define GPDMA1_Channel14       ((DMA_Channel_TypeDef *) GPDMA1_Channel14_BASE)
#define GPDMA1_Channel15       ((DMA_Channel_TypeDef *) GPDMA1_Channel15_BASE)
#define GPIOA                  ((GPIO_TypeDef *) GPIOA_BASE)
#define GPIOB                  ((GPIO_TypeDef *) GPIOB_BASE)
#define GPIOC                  ((GPIO_TypeDef *) GPIOC_BASE)
#define GPIOD                  ((GPIO_TypeDef *) GPIOD_BASE)
#define GPIOE                  ((GPIO_TypeDef *) GPIOE_BASE)
#define GPIOF                  ((GPIO_TypeDef *) GPIOF_BASE)
#define GPIOG                  ((GPIO_TypeDef *) GPIOG_BASE)
#define GPIOH                  ((GPIO_TypeDef *) GPIOH_BASE)
#define GPIOM                  ((GPIO_TypeDef *) GPIOM_BASE)
#define GPION                  ((GPIO_TypeDef *) GPION_BASE)
#define GPIOO                  ((GPIO_TypeDef *) GPIOO_BASE)
#define GPIOP                  ((GPIO_TypeDef *) GPIOP_BASE)
#define HASH                   ((HASH_TypeDef *) HASH_BASE)
#define HASH_DIGEST            ((HASH_DIGEST_TypeDef *) HASH_DIGEST_BASE)
#define HPDMA1                 ((DMA_TypeDef *) HPDMA1_BASE)
#define HPDMA1_Channel0        ((DMA_Channel_TypeDef *) HPDMA1_Channel0_BASE)
#define HPDMA1_Channel1        ((DMA_Channel_TypeDef *) HPDMA1_Channel1_BASE)
#define HPDMA1_Channel2        ((DMA_Channel_TypeDef *) HPDMA1_Channel2_BASE)
#define HPDMA1_Channel3        ((DMA_Channel_TypeDef *) HPDMA1_Channel3_BASE)
#define HPDMA1_Channel4        ((DMA_Channel_TypeDef *) HPDMA1_Channel4_BASE)
#define HPDMA1_Channel5        ((DMA_Channel_TypeDef *) HPDMA1_Channel5_BASE)
#define HPDMA1_Channel6        ((DMA_Channel_TypeDef *) HPDMA1_Channel6_BASE)
#define HPDMA1_Channel7        ((DMA_Channel_TypeDef *) HPDMA1_Channel7_BASE)
#define HPDMA1_Channel8        ((DMA_Channel_TypeDef *) HPDMA1_Channel8_BASE)
#define HPDMA1_Channel9        ((DMA_Channel_TypeDef *) HPDMA1_Channel9_BASE)
#define HPDMA1_Channel10       ((DMA_Channel_TypeDef *) HPDMA1_Channel10_BASE)
#define HPDMA1_Channel11       ((DMA_Channel_TypeDef *) HPDMA1_Channel11_BASE)
#define HPDMA1_Channel12       ((DMA_Channel_TypeDef *) HPDMA1_Channel12_BASE)
#define HPDMA1_Channel13       ((DMA_Channel_TypeDef *) HPDMA1_Channel13_BASE)
#define HPDMA1_Channel14       ((DMA_Channel_TypeDef *) HPDMA1_Channel14_BASE)
#define HPDMA1_Channel15       ((DMA_Channel_TypeDef *) HPDMA1_Channel15_BASE)
#define ICACHE                 ((ICACHE_TypeDef *) ICACHE_BASE)
#define JPEG                   ((JPEG_TypeDef *) JPEG_BASE)
#define I2C1                   ((I2C_TypeDef *) I2C1_BASE)
#define I2C2                   ((I2C_TypeDef *) I2C2_BASE)
#define I2C3                   ((I2C_TypeDef *) I2C3_BASE)
#define I3C1                   ((I3C_TypeDef *) I3C1_BASE)
#define IWDG                   ((IWDG_TypeDef *) IWDG_BASE)
#define LPTIM1                 ((LPTIM_TypeDef *) LPTIM1_BASE)
#define LPTIM2                 ((LPTIM_TypeDef *) LPTIM2_BASE)
#define LPTIM3                 ((LPTIM_TypeDef *) LPTIM3_BASE)
#define LPTIM4                 ((LPTIM_TypeDef *) LPTIM4_BASE)
#define LPTIM5                 ((LPTIM_TypeDef *) LPTIM5_BASE)
#define LPUART1                ((USART_TypeDef *) LPUART1_BASE)
#define LTDC                   ((LTDC_TypeDef *)LTDC_BASE)
#define LTDC_Layer1            ((LTDC_Layer_TypeDef *)LTDC_Layer1_BASE)
#define LTDC_Layer2            ((LTDC_Layer_TypeDef *)LTDC_Layer2_BASE)
#define MCE1                   ((MCE_TypeDef *) MCE1_BASE)
#define MCE1_REGION1           ((MCE_Region_TypeDef *) MCE1_REGION1_BASE)
#define MCE1_REGION2           ((MCE_Region_TypeDef *) MCE1_REGION2_BASE)
#define MCE1_REGION3           ((MCE_Region_TypeDef *) MCE1_REGION3_BASE)
#define MCE1_REGION4           ((MCE_Region_TypeDef *) MCE1_REGION4_BASE)
#define MCE1_CONTEXT1          ((MCE_Context_TypeDef *) MCE1_CONTEXT1_BASE)
#define MCE1_CONTEXT2          ((MCE_Context_TypeDef *) MCE1_CONTEXT2_BASE)
#define MCE2                   ((MCE_TypeDef *) MCE2_BASE)
#define MCE2_REGION1           ((MCE_Region_TypeDef *) MCE2_REGION1_BASE)
#define MCE2_REGION2           ((MCE_Region_TypeDef *) MCE2_REGION2_BASE)
#define MCE2_REGION3           ((MCE_Region_TypeDef *) MCE2_REGION3_BASE)
#define MCE2_REGION4           ((MCE_Region_TypeDef *) MCE2_REGION4_BASE)
#define MCE3                   ((MCE_TypeDef *) MCE3_BASE)
#define MCE3_REGION1           ((MCE_Region_TypeDef *) MCE3_REGION1_BASE)
#define MCE3_REGION2           ((MCE_Region_TypeDef *) MCE3_REGION2_BASE)
#define MCE3_REGION3           ((MCE_Region_TypeDef *) MCE3_REGION3_BASE)
#define MCE3_REGION4           ((MCE_Region_TypeDef *) MCE3_REGION4_BASE)
#define MDIOS                  ((MDIOS_TypeDef *) MDIOS_BASE)
#define PKA                    ((PKA_TypeDef *) PKA_BASE)
#define PSSI                   ((PSSI_TypeDef *) PSSI_BASE)
#define PWR                    ((PWR_TypeDef *) PWR_BASE)
#define RAMECC1                ((RAMECC_TypeDef *)RAMECC1_BASE)
#define RAMECC2                ((RAMECC_TypeDef *)RAMECC2_BASE)
#define RAMECC1_Monitor0       ((RAMECC_MonitorTypeDef *)RAMECC1_Monitor0_BASE)
#define RAMECC1_Monitor1       ((RAMECC_MonitorTypeDef *)RAMECC1_Monitor1_BASE)
#define RAMECC1_Monitor2       ((RAMECC_MonitorTypeDef *)RAMECC1_Monitor2_BASE)
#define RAMECC1_Monitor3       ((RAMECC_MonitorTypeDef *)RAMECC1_Monitor3_BASE)
#define RAMECC1_Monitor4       ((RAMECC_MonitorTypeDef *)RAMECC1_Monitor4_BASE)
#define RAMECC2_Monitor1       ((RAMECC_MonitorTypeDef *)RAMECC2_Monitor1_BASE)
#define RCC                    ((RCC_TypeDef *) RCC_BASE)
#define RNG                    ((RNG_TypeDef *) RNG_BASE)
#define RTC                    ((RTC_TypeDef *) RTC_BASE)
#define SAES                   ((SAES_TypeDef *) SAES_BASE)
#define SAI1                   ((SAI_TypeDef *) SAI1_BASE)
#define SAI1_Block_A           ((SAI_Block_TypeDef *) SAI1_Block_A_BASE)
#define SAI1_Block_B           ((SAI_Block_TypeDef *) SAI1_Block_B_BASE)
#define SAI2                   ((SAI_TypeDef *) SAI2_BASE)
#define SAI2_Block_A           ((SAI_Block_TypeDef *) SAI2_Block_A_BASE)
#define SAI2_Block_B           ((SAI_Block_TypeDef *) SAI2_Block_B_BASE)
#define SBS                    ((SBS_TypeDef *) SBS_BASE)
#define SDMMC1                 ((SDMMC_TypeDef *) SDMMC1_BASE)
#define SDMMC2                 ((SDMMC_TypeDef *) SDMMC2_BASE)
#define SPI1                   ((SPI_TypeDef *) SPI1_BASE)
#define SPI2                   ((SPI_TypeDef *) SPI2_BASE)
#define SPI3                   ((SPI_TypeDef *) SPI3_BASE)
#define SPI4                   ((SPI_TypeDef *) SPI4_BASE)
#define SPI5                   ((SPI_TypeDef *) SPI5_BASE)
#define SPI6                   ((SPI_TypeDef *) SPI6_BASE)
#define SPDIFRX                ((SPDIFRX_TypeDef *) SPDIFRX_BASE)
#define TAMP                   ((TAMP_TypeDef *) TAMP_BASE)
#define TIM1                   ((TIM_TypeDef *) TIM1_BASE)
#define TIM2                   ((TIM_TypeDef *) TIM2_BASE)
#define TIM3                   ((TIM_TypeDef *) TIM3_BASE)
#define TIM4                   ((TIM_TypeDef *) TIM4_BASE)
#define TIM5                   ((TIM_TypeDef *) TIM5_BASE)
#define TIM6                   ((TIM_TypeDef *) TIM6_BASE)
#define TIM7                   ((TIM_TypeDef *) TIM7_BASE)
#define TIM9                   ((TIM_TypeDef *) TIM9_BASE)
#define TIM12                  ((TIM_TypeDef *) TIM12_BASE)
#define TIM13                  ((TIM_TypeDef *) TIM13_BASE)
#define TIM14                  ((TIM_TypeDef *) TIM14_BASE)
#define TIM15                  ((TIM_TypeDef *) TIM15_BASE)
#define TIM16                  ((TIM_TypeDef *) TIM16_BASE)
#define TIM17                  ((TIM_TypeDef *) TIM17_BASE)
#define USART1                 ((USART_TypeDef *) USART1_BASE)
#define USART2                 ((USART_TypeDef *) USART2_BASE)
#define USART3                 ((USART_TypeDef *) USART3_BASE)
#define UART4                  ((USART_TypeDef *) UART4_BASE)
#define UART5                  ((USART_TypeDef *) UART5_BASE)
#define UART7                  ((USART_TypeDef *) UART7_BASE)
#define UART8                  ((USART_TypeDef *) UART8_BASE)
#define UCPD1                  ((UCPD_TypeDef *) UCPD1_BASE)
#define USB_OTG_HS             ((USB_OTG_GlobalTypeDef *) USB_OTG_HS_PERIPH_BASE)
#define USB_OTG_FS             ((USB_OTG_GlobalTypeDef *) USB_OTG_FS_PERIPH_BASE)
#define WWDG                   ((WWDG_TypeDef *) WWDG_BASE)
#define XSPI1                  ((XSPI_TypeDef *) XSPI1_R_BASE)
#define XSPI2                  ((XSPI_TypeDef *) XSPI2_R_BASE)
#define XSPIM                  ((XSPIM_TypeDef *) XSPIM_BASE)
#define VREFBUF                ((VREFBUF_TypeDef *) VREFBUF_BASE)

/** @} */ /* End of group STM32H7RSxx_Peripheral_declaration */

/** @addtogroup STM32H7RSxx_Peripheral_Exported_constants
  * @{
  */

/** @addtogroup STM32H7RSxx_Peripheral_Hardware_Constant_Definition
  * @{
  */
#define LSI_STARTUP_TIME       130U /*!< LSI Maximum startup time in us */
/**
  * @}
  */

/** @addtogroup STM32H7RSxx_Peripheral_Registers_Bits_Definition
  * @{
  */
/******************************************************************************/
/*                         Peripheral Registers Bits Definition               */
/******************************************************************************/

/******************************************************************************/
/*                                                                            */
/*                        Analog to Digital Converter                         */
/*                                                                            */
/******************************************************************************/

