RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/CMSIS/Device/ST/STM32H7RSxx/Include/stm32h7s7xx.h
/*******************  Bit definition for AXIM_ASIB_READQOS register  ********/
#define AXIM_ASIB_READQOS_AR_QOS_Pos       (0U)
#define AXIM_ASIB_READQOS_AR_QOS_Msk       (0xFUL << AXIM_ASIB_READQOS_AR_QOS_Pos)          /*!< 0x0000000F */
#define AXIM_ASIB_READQOS_AR_QOS           AXIM_ASIB_READQOS_AR_QOS_Msk                     /*!< Read channel QoS setting */

/*******************  Bit definition for AXIM_ASIB_WRITEQOS register  *******/
#define AXIM_ASIB_WRITEQOS_AW_QOS_Pos       (0U)
#define AXIM_ASIB_WRITEQOS_AW_QOS_Msk       (0xFUL << AXIM_ASIB_WRITEQOS_AW_QOS_Pos)        /*!< 0x0000000F */
#define AXIM_ASIB_WRITEQOS_AW_QOS           AXIM_ASIB_WRITEQOS_AW_QOS_Msk                   /*!< Write channel QoS setting */

/*******************  Bit definition for AXIM_ASIB_FNMOD register  **********/
#define AXIM_ASIB_FNMOD_READ_ISS_Pos        (0U)
#define AXIM_ASIB_FNMOD_READ_ISS_Msk        (0x1UL << AXIM_ASIB_FNMOD_READ_ISS_Pos)         /*!< 0x00000001 */
#define AXIM_ASIB_FNMOD_READ_ISS            AXIM_ASIB_FNMOD_READ_ISS_Msk                    /*!< Force read issuing capability to 1 */
#define AXIM_ASIB_FNMOD_WRITE_ISS_Pos       (1U)
#define AXIM_ASIB_FNMOD_WRITE_ISS_Msk       (0x1UL << AXIM_ASIB_FNMOD_WRITE_ISS_Pos)        /*!< 0x00000002 */
#define AXIM_ASIB_FNMOD_WRITE_ISS           AXIM_ASIB_FNMOD_WRITE_ISS_Msk                   /*!< Force write issuing capability to 1 */

/*******************  Bit definition for AXIM_AMIB_FNMODBMISS register  **********/
#define AXIM_AMIB_FNMODBMISS_READ_ISS_Pos   (0U)
#define AXIM_AMIB_FNMODBMISS_READ_ISS_Msk   (0x1UL << AXIM_AMIB_FNMODBMISS_READ_ISS_Pos)     /*!< 0x00000001 */
#define AXIM_AMIB_FNMODBMISS_READ_ISS       AXIM_AMIB_FNMODBMISS_READ_ISS_Msk                /*!< Force read issuing capability to 1 */
#define AXIM_AMIB_FNMODBMISS_WRITE_ISS_Pos  (1U)
#define AXIM_AMIB_FNMODBMISS_WRITE_ISS_Msk  (0x1UL << AXIM_AMIB_FNMODBMISS_WRITE_ISS_Pos)    /*!< 0x00000002 */
#define AXIM_AMIB_FNMODBMISS_WRITE_ISS      AXIM_AMIB_FNMODBMISS_WRITE_ISS_Msk               /*!< Force write issuing capability to 1 */

/*******************  Bit definition for AXIM_AMIB_FNMOD2 register  **********/
#define AXIM_AMIB_FNMOD2_BYPASS_MERGE_Pos   (0U)
#define AXIM_AMIB_FNMOD2_BYPASS_MERGE_Msk   (0x1UL << AXIM_AMIB_FNMOD2_BYPASS_MERGE_Pos)    /*!< 0x00000001 */
#define AXIM_AMIB_FNMOD2_BYPASS_MERGE       AXIM_AMIB_FNMOD2_BYPASS_MERGE_Msk               /*!< Bypass Merge enable */

/*******************  Bit definition for AXIM_AMIB_FNMODLB register  **********/
#define AXIM_AMIB_FNMODLB_LONG_BURST_Pos    (0U)
#define AXIM_AMIB_FNMODLB_LONG_BURST_Msk    (0x1UL << AXIM_AMIB_FNMODLB_LONG_BURST_Pos)     /*!< 0x00000001 */
#define AXIM_AMIB_FNMODLB_LONG_BURST        AXIM_AMIB_FNMODLB_LONG_BURST_Msk                /*!< Long bursts can be generated */

/*******************  Bit definition for AXIM_AMIB_FNMOD register  **********/
#define AXIM_AMIB_FNMOD_READ_ISS_Pos        (0U)
#define AXIM_AMIB_FNMOD_READ_ISS_Msk        (0x1UL << AXIM_AMIB_FNMOD_READ_ISS_Pos)         /*!< 0x00000001 */
#define AXIM_AMIB_FNMOD_READ_ISS            AXIM_AMIB_FNMOD_READ_ISS_Msk                    /*!< Force read issuing capability to 1 */
#define AXIM_AMIB_FNMOD_WRITE_ISS_Pos       (1U)
#define AXIM_AMIB_FNMOD_WRITE_ISS_Msk       (0x1UL << AXIM_AMIB_FNMOD_WRITE_ISS_Pos)        /*!< 0x00000002 */
#define AXIM_AMIB_FNMOD_WRITE_ISS           AXIM_AMIB_FNMOD_WRITE_ISS_Msk                   /*!< Force write issuing capability to 1 */

/******************************************************************************/
/*                                                                            */
/*                                   VREFBUF                                  */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for VREFBUF_CSR register  ****************/
#define VREFBUF_CSR_ENVR_Pos        (0U)
#define VREFBUF_CSR_ENVR_Msk        (0x1UL << VREFBUF_CSR_ENVR_Pos)            /*!< 0x00000001 */
#define VREFBUF_CSR_ENVR            VREFBUF_CSR_ENVR_Msk                       /*!<Voltage reference buffer enable */
#define VREFBUF_CSR_HIZ_Pos         (1U)
#define VREFBUF_CSR_HIZ_Msk         (0x1UL << VREFBUF_CSR_HIZ_Pos)             /*!< 0x00000002 */
#define VREFBUF_CSR_HIZ             VREFBUF_CSR_HIZ_Msk                        /*!<High impedance mode             */
#define VREFBUF_CSR_VRR_Pos         (3U)
#define VREFBUF_CSR_VRR_Msk         (0x1UL << VREFBUF_CSR_VRR_Pos)             /*!< 0x00000008 */
#define VREFBUF_CSR_VRR             VREFBUF_CSR_VRR_Msk                        /*!<Voltage reference buffer ready  */
#define VREFBUF_CSR_VRS_Pos         (4U)
#define VREFBUF_CSR_VRS_Msk         (0x7UL << VREFBUF_CSR_VRS_Pos)             /*!< 0x00000070 */
#define VREFBUF_CSR_VRS             VREFBUF_CSR_VRS_Msk                        /*!<Voltage reference scale         */

#define VREFBUF_CSR_VRS_OUT1        ((uint32_t)0x00000000)                     /*!<Voltage reference VREF_OUT1     */
#define VREFBUF_CSR_VRS_OUT2_Pos    (4U)
#define VREFBUF_CSR_VRS_OUT2_Msk    (0x1UL << VREFBUF_CSR_VRS_OUT2_Pos)        /*!< 0x00000010 */
#define VREFBUF_CSR_VRS_OUT2        VREFBUF_CSR_VRS_OUT2_Msk                   /*!<Voltage reference VREF_OUT2     */
#define VREFBUF_CSR_VRS_OUT3_Pos    (5U)
#define VREFBUF_CSR_VRS_OUT3_Msk    (0x1UL << VREFBUF_CSR_VRS_OUT3_Pos)        /*!< 0x00000020 */
#define VREFBUF_CSR_VRS_OUT3        VREFBUF_CSR_VRS_OUT3_Msk                   /*!<Voltage reference VREF_OUT3     */
#define VREFBUF_CSR_VRS_OUT4_Pos    (4U)
#define VREFBUF_CSR_VRS_OUT4_Msk    (0x3UL << VREFBUF_CSR_VRS_OUT4_Pos)        /*!< 0x00000030 */
#define VREFBUF_CSR_VRS_OUT4        VREFBUF_CSR_VRS_OUT4_Msk                   /*!<Voltage reference VREF_OUT4     */

/*******************  Bit definition for VREFBUF_CCR register  ****************/
#define VREFBUF_CCR_TRIM_Pos        (0U)
#define VREFBUF_CCR_TRIM_Msk        (0x3FUL << VREFBUF_CCR_TRIM_Pos)           /*!< 0x0000003F */
#define VREFBUF_CCR_TRIM            VREFBUF_CCR_TRIM_Msk                       /*!<TRIM[5:0] bits (Trimming code)  */

/******************************************************************************/
/*                                                                            */
/*                          HDMI-CEC (CEC)                                    */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for CEC_CR register  *********************/
#define CEC_CR_CECEN_Pos         (0U)
#define CEC_CR_CECEN_Msk         (0x1UL << CEC_CR_CECEN_Pos)                   /*!< 0x00000001 */
#define CEC_CR_CECEN             CEC_CR_CECEN_Msk                              /*!< CEC Enable                                */
#define CEC_CR_TXSOM_Pos         (1U)
#define CEC_CR_TXSOM_Msk         (0x1UL << CEC_CR_TXSOM_Pos)                   /*!< 0x00000002 */
#define CEC_CR_TXSOM             CEC_CR_TXSOM_Msk                              /*!< CEC Tx Start Of Message                   */
#define CEC_CR_TXEOM_Pos         (2U)
#define CEC_CR_TXEOM_Msk         (0x1UL << CEC_CR_TXEOM_Pos)                   /*!< 0x00000004 */
#define CEC_CR_TXEOM             CEC_CR_TXEOM_Msk                              /*!< CEC Tx End Of Message                     */

/*******************  Bit definition for CEC_CFGR register  *******************/
#define CEC_CFGR_SFT_Pos         (0U)
#define CEC_CFGR_SFT_Msk         (0x7UL << CEC_CFGR_SFT_Pos)                   /*!< 0x00000007 */
#define CEC_CFGR_SFT             CEC_CFGR_SFT_Msk                              /*!< CEC Signal Free Time                      */
#define CEC_CFGR_RXTOL_Pos       (3U)
#define CEC_CFGR_RXTOL_Msk       (0x1UL << CEC_CFGR_RXTOL_Pos)                 /*!< 0x00000008 */
#define CEC_CFGR_RXTOL           CEC_CFGR_RXTOL_Msk                            /*!< CEC Tolerance                             */
#define CEC_CFGR_BRESTP_Pos      (4U)
#define CEC_CFGR_BRESTP_Msk      (0x1UL << CEC_CFGR_BRESTP_Pos)                /*!< 0x00000010 */
#define CEC_CFGR_BRESTP          CEC_CFGR_BRESTP_Msk                           /*!< CEC Rx Stop                               */
#define CEC_CFGR_BREGEN_Pos      (5U)
#define CEC_CFGR_BREGEN_Msk      (0x1UL << CEC_CFGR_BREGEN_Pos)                /*!< 0x00000020 */
#define CEC_CFGR_BREGEN          CEC_CFGR_BREGEN_Msk                           /*!< CEC Bit Rising Error generation           */
#define CEC_CFGR_LBPEGEN_Pos     (6U)
#define CEC_CFGR_LBPEGEN_Msk     (0x1UL << CEC_CFGR_LBPEGEN_Pos)               /*!< 0x00000040 */
#define CEC_CFGR_LBPEGEN         CEC_CFGR_LBPEGEN_Msk                          /*!< CEC Long Bit Period Error generation      */
#define CEC_CFGR_SFTOPT_Pos      (8U)
#define CEC_CFGR_SFTOPT_Msk      (0x1UL << CEC_CFGR_SFTOPT_Pos)                /*!< 0x00000100 */
#define CEC_CFGR_SFTOPT          CEC_CFGR_SFTOPT_Msk                           /*!< CEC Signal Free Time optional             */
#define CEC_CFGR_BRDNOGEN_Pos    (7U)
#define CEC_CFGR_BRDNOGEN_Msk    (0x1UL << CEC_CFGR_BRDNOGEN_Pos)              /*!< 0x00000080 */
#define CEC_CFGR_BRDNOGEN        CEC_CFGR_BRDNOGEN_Msk                         /*!< CEC Broadcast No error generation         */
#define CEC_CFGR_OAR_Pos         (16U)
#define CEC_CFGR_OAR_Msk         (0x7FFFUL << CEC_CFGR_OAR_Pos)                /*!< 0x7FFF0000 */
#define CEC_CFGR_OAR             CEC_CFGR_OAR_Msk                              /*!< CEC Own Address                           */
#define CEC_CFGR_LSTN_Pos        (31U)
#define CEC_CFGR_LSTN_Msk        (0x1UL << CEC_CFGR_LSTN_Pos)                  /*!< 0x80000000 */
#define CEC_CFGR_LSTN            CEC_CFGR_LSTN_Msk                             /*!< CEC Listen mode                           */

