RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/CMSIS/Device/ST/STM32H7RSxx/Include/stm32h7s7xx.h
/*******************  Bit definition for DCMIPP_P0PPM0AR1 register  ***********/
#define DCMIPP_P0PPM0AR1_MOA_Pos       (0U)
#define DCMIPP_P0PPM0AR1_MOA_Msk       (0xFFFFFFFFUL << DCMIPP_P0PPM0AR1_MOA_Pos) /*!< 0xFFFFFFFF */
#define DCMIPP_P0PPM0AR1_MOA           DCMIPP_P0PPM0AR1_MOA_Msk                   /*!< Memory 0 address register 1 */

/*******************  Bit definition for DCMIPP_P0PPM0AR2 register  ***********/
#define DCMIPP_P0PPM0AR2_MOA_Pos       (0U)
#define DCMIPP_P0PPM0AR2_MOA_Msk       (0xFFFFFFFFUL << DCMIPP_P0PPM0AR2_MOA_Pos) /*!< 0xFFFFFFFF */
#define DCMIPP_P0PPM0AR2_MOA           DCMIPP_P0PPM0AR2_MOA_Msk                   /*!< Memory 0 address register 2 */

/*******************  Bit definition for DCMIPP_P0IER register  ***************/
#define DCMIPP_P0IER_LINEIE_Pos        (0U)
#define DCMIPP_P0IER_LINEIE_Msk        (0x1UL << DCMIPP_P0IER_LINEIE_Pos)      /*!< 0x00000001 */
#define DCMIPP_P0IER_LINEIE            DCMIPP_P0IER_LINEIE_Msk                 /*!< multi-Line Capture completed interrupt enable */
#define DCMIPP_P0IER_FRAMEIE_Pos       (1U)
#define DCMIPP_P0IER_FRAMEIE_Msk       (0x1UL << DCMIPP_P0IER_FRAMEIE_Pos)     /*!< 0x00000002 */
#define DCMIPP_P0IER_FRAMEIE           DCMIPP_P0IER_FRAMEIE_Msk                /*!< Frame Capture completed interrupt enable */
#define DCMIPP_P0IER_VSYNCIE_Pos       (2U)
#define DCMIPP_P0IER_VSYNCIE_Msk       (0x1UL << DCMIPP_P0IER_VSYNCIE_Pos)     /*!< 0x00000004 */
#define DCMIPP_P0IER_VSYNCIE           DCMIPP_P0IER_VSYNCIE_Msk                /*!< VSYNC interrupt enable */
#define DCMIPP_P0IER_LIMITIE_Pos       (6U)
#define DCMIPP_P0IER_LIMITIE_Msk       (0x1UL << DCMIPP_P0IER_LIMITIE_Pos)     /*!< 0x00000040 */
#define DCMIPP_P0IER_LIMITIE           DCMIPP_P0IER_LIMITIE_Msk                /*!< Limit interrupt enable */
#define DCMIPP_P0IER_OVRIE_Pos         (7U)
#define DCMIPP_P0IER_OVRIE_Msk         (0x1UL << DCMIPP_P0IER_OVRIE_Pos)       /*!< 0x00000080 */
#define DCMIPP_P0IER_OVRIE             DCMIPP_P0IER_OVRIE_Msk                  /*!< Overrun interrupt enable */

/*******************  Bit definition for DCMIPP_P0SR register  ****************/
#define DCMIPP_P0SR_LINEF_Pos          (0U)
#define DCMIPP_P0SR_LINEF_Msk          (0x1UL << DCMIPP_P0SR_LINEF_Pos)        /*!< 0x00000001 */
#define DCMIPP_P0SR_LINEF              DCMIPP_P0SR_LINEF_Msk                   /*!< multi-Line Capture completed interrupt status */
#define DCMIPP_P0SR_FRAMEF_Pos         (1U)
#define DCMIPP_P0SR_FRAMEF_Msk         (0x1UL << DCMIPP_P0SR_FRAMEF_Pos)       /*!< 0x00000002 */
#define DCMIPP_P0SR_FRAMEF             DCMIPP_P0SR_FRAMEF_Msk                  /*!< Frame Capture completed interrupt status */
#define DCMIPP_P0SR_VSYNCF_Pos         (2U)
#define DCMIPP_P0SR_VSYNCF_Msk         (0x1UL << DCMIPP_P0SR_VSYNCF_Pos)       /*!< 0x00000004 */
#define DCMIPP_P0SR_VSYNCF             DCMIPP_P0SR_VSYNCF_Msk                  /*!< VSYNC interrupt status */
#define DCMIPP_P0SR_LIMITF_Pos         (6U)
#define DCMIPP_P0SR_LIMITF_Msk         (0x1UL << DCMIPP_P0SR_LIMITF_Pos)       /*!< 0x00000040 */
#define DCMIPP_P0SR_LIMITF             DCMIPP_P0SR_LIMITF_Msk                  /*!< Limit interrupt status */
#define DCMIPP_P0SR_OVRF_Pos           (7U)
#define DCMIPP_P0SR_OVRF_Msk           (0x1UL << DCMIPP_P0SR_OVRF_Pos)         /*!< 0x00000080 */
#define DCMIPP_P0SR_OVRF               DCMIPP_P0SR_OVRF_Msk                    /*!< Overrun interrupt status */
#define DCMIPP_P0SR_LSTLINE_Pos        (16U)
#define DCMIPP_P0SR_LSTLINE_Msk        (0x1UL << DCMIPP_P0SR_LSTLINE_Pos)      /*!< 0x00010000 */
#define DCMIPP_P0SR_LSTLINE            DCMIPP_P0SR_LSTLINE_Msk                 /*!< Last Line Lsb bit */
#define DCMIPP_P0SR_CPTACT_Pos         (23U)
#define DCMIPP_P0SR_CPTACT_Msk         (0x1UL << DCMIPP_P0SR_CPTACT_Pos)       /*!< 0x00800000 */
#define DCMIPP_P0SR_CPTACT             DCMIPP_P0SR_CPTACT_Msk                  /*!< Capture immediate status */

/*******************  Bit definition for DCMIPP_P0FCR register  ***************/
#define DCMIPP_P0FCR_CLINEF_Pos        (0U)
#define DCMIPP_P0FCR_CLINEF_Msk        (0x1UL << DCMIPP_P0FCR_CLINEF_Pos)      /*!< 0x00000001 */
#define DCMIPP_P0FCR_CLINEF            DCMIPP_P0FCR_CLINEF_Msk                 /*!< multi-Line Capture completed interrupt status clear */
#define DCMIPP_P0FCR_CFRAMEF_Pos       (1U)
#define DCMIPP_P0FCR_CFRAMEF_Msk       (0x1UL << DCMIPP_P0FCR_CFRAMEF_Pos)     /*!< 0x00000002 */
#define DCMIPP_P0FCR_CFRAMEF           DCMIPP_P0FCR_CFRAMEF_Msk                /*!< Frame Capture completed interrupt status clear */
#define DCMIPP_P0FCR_CVSYNCF_Pos       (2U)
#define DCMIPP_P0FCR_CVSYNCF_Msk       (0x1UL << DCMIPP_P0FCR_CVSYNCF_Pos)     /*!< 0x00000004 */
#define DCMIPP_P0FCR_CVSYNCF           DCMIPP_P0FCR_CVSYNCF_Msk                /*!< VSYNC interrupt status clear */
#define DCMIPP_P0FCR_CLIMITF_Pos       (6U)
#define DCMIPP_P0FCR_CLIMITF_Msk       (0x1UL << DCMIPP_P0FCR_CLIMITF_Pos)     /*!< 0x00000040 */
#define DCMIPP_P0FCR_CLIMITF           DCMIPP_P0FCR_CLIMITF_Msk                /*!< Limit interrupt status clear */
#define DCMIPP_P0FCR_COVRF_Pos         (7U)
#define DCMIPP_P0FCR_COVRF_Msk         (0x1UL << DCMIPP_P0FCR_COVRF_Pos)       /*!< 0x00000080 */
#define DCMIPP_P0FCR_COVRF             DCMIPP_P0FCR_COVRF_Msk                  /*!< Overrun interrupt status clear */

/*******************  Bit definition for DCMIPP_P0CFCTCR register  ************/
#define DCMIPP_P0CFCTCR_FRATE_Pos      (0U)
#define DCMIPP_P0CFCTCR_FRATE_Msk      (0x3UL << DCMIPP_P0CFCTCR_FRATE_Pos)    /*!< 0x00000003 */
#define DCMIPP_P0CFCTCR_FRATE          DCMIPP_P0CFCTCR_FRATE_Msk               /*!< FRATE[1:0]: Frame capture rate control */
#define DCMIPP_P0CFCTCR_CPTMODE_Pos    (2U)
#define DCMIPP_P0CFCTCR_CPTMODE_Msk    (0x1UL << DCMIPP_P0CFCTCR_CPTMODE_Pos)  /*!< 0x00000004 */
#define DCMIPP_P0CFCTCR_CPTMODE        DCMIPP_P0CFCTCR_CPTMODE_Msk             /*!< Capture mode */
#define DCMIPP_P0CFCTCR_CPTREQ_Pos     (3U)
#define DCMIPP_P0CFCTCR_CPTREQ_Msk     (0x1UL << DCMIPP_P0CFCTCR_CPTREQ_Pos)   /*!< 0x00000008 */
#define DCMIPP_P0CFCTCR_CPTREQ         DCMIPP_P0CFCTCR_CPTREQ_Msk              /*!< Capture requested */

/*******************  Bit definition for DCMIPP_P0CSCSTR register  ************/
#define DCMIPP_P0CSCSTR_HSTART_Pos     (0U)
#define DCMIPP_P0CSCSTR_HSTART_Msk     (0xFFFUL << DCMIPP_P0CSCSTR_HSTART_Pos) /*!< 0x00000FFF */
#define DCMIPP_P0CSCSTR_HSTART         DCMIPP_P0CSCSTR_HSTART_Msk              /*!< HSTART[11:0]: horizontal start */
#define DCMIPP_P0CSCSTR_VSTART_Pos     (16U)
#define DCMIPP_P0CSCSTR_VSTART_Msk     (0xFFFUL << DCMIPP_P0CSCSTR_VSTART_Pos) /*!< 0x0FFF0000 */
#define DCMIPP_P0CSCSTR_VSTART         DCMIPP_P0CSCSTR_VSTART_Msk              /*!< VSTART[11:0]: vertical start */

/*******************  Bit definition for DCMIPP_P0CSCSZR register  ************/
#define DCMIPP_P0CSCSZR_HSIZE_Pos      (0U)
#define DCMIPP_P0CSCSZR_HSIZE_Msk      (0xFFFUL << DCMIPP_P0CSCSZR_HSIZE_Pos)  /*!< 0x00000FFF */
#define DCMIPP_P0CSCSZR_HSIZE          DCMIPP_P0CSCSZR_HSIZE_Msk               /*!< HSTART[11:0]: horizontal size */
#define DCMIPP_P0CSCSZR_VSIZE_Pos      (16U)
#define DCMIPP_P0CSCSZR_VSIZE_Msk      (0xFFFUL << DCMIPP_P0CSCSZR_VSIZE_Pos)  /*!< 0x0FFF0000 */
#define DCMIPP_P0CSCSZR_VSIZE          DCMIPP_P0CSCSZR_VSIZE_Msk               /*!< VSTART[11:0]: vertical size */
#define DCMIPP_P0CSCSZR_POSNEG_Pos     (30U)
#define DCMIPP_P0CSCSZR_POSNEG_Msk     (0x1UL << DCMIPP_P0CSCSZR_POSNEG_Pos)   /*!< 0x40000000 */
#define DCMIPP_P0CSCSZR_POSNEG         DCMIPP_P0CSCSZR_POSNEG_Msk              /*!< Negative area */
#define DCMIPP_P0CSCSZR_ENABLE_Pos     (31U)
#define DCMIPP_P0CSCSZR_ENABLE_Msk     (0x1UL << DCMIPP_P0CSCSZR_ENABLE_Pos)   /*!< 0x80000000 */
#define DCMIPP_P0CSCSZR_ENABLE         DCMIPP_P0CSCSZR_ENABLE_Msk              /*!< Enable */

